run/bump_Minf0675/0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.654825244893;

boundaryField
{
    INLE1
    {
        type            calculated;
        value           uniform 0.654825244893;
    }
    PRES2
    {
        type            calculated;
        value           uniform 0.654825244893;
    }
    WALL3
    {
        type            calculated;
        value           uniform 0.654825244893;
    }
    WALL4
    {
        type            calculated;
        value           nonuniform List<scalar> 
66
(
0.654825244893
0.654825244893
0.654825244893
0.654825244893
0.654825244893
0.654825244893
0.654825244893
0.654825244893
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
